[LANG]
language=Danish (Danmark)
[FONT]
font-name=Segoe UI
welcome-text-size=62
home-text-size=22
home-section-size=24
analysis-text-size=20
analysis-section-size=22
left-panel-size=14
panel-list-size=16
panel-list-label-size=20
panel-list-header-size=16
panel-list-item-size=13
panel-button-size=12
combobox-size=16
list-combobox-size=16
checkbox-size=16
radio-size=15
elem-size=12
image-button-size=14
form-text-size=15
list-text-size=16
search-edit-size=16
message-text-size=16
setting-button-size=12
process-text-size=14
properites-title-font=18
properites-section-font=16
log-list-item-text-size=12
log-list-item-sql-size=14
[ERROR]
000000=
200001=SQL-syntaksfejl
200002=Filen eksisterer ikke
200003=Filen er beskadiget
200004=Parameterfejl
200026=Tabelnavn findes allerede
200027=Tabelnavn findes ikke
200028=Fejl ved import af CSV-fil, kunne ikke generere SQL, tjek CSV-filens indhold og konfiguration
300001=Ingen tabelkolonne valgt til at oprette indeks
300002=SQL-sætning må ikke være tom
300003=SQL-analyse understøtter kun SELECT-forespørgsler
[STRING]
home=Hjem
database=Database
analysis=Analyse
view=Visning
setting=Indstillinger
items=poster
tables=Tabeller
views=Visninger
triggers=Triggers
columns=Kolonner
indexes=Indekser
table=Tabel
clear-all=Ryd alt
yes=Ja
no=Nej
welcome-text=Velkommen til CuteSqlite
home-text1=CuteSqlite er et grafisk klientværktøj (GUI) til Sqlite3.
home-text2=Det giver dig mulighed for at designe, oprette og gennemse databaser, administrere databaseobjekter,
home-text3=og indsætte data samt designe og køre SQL-forespørgsler til at behandle lagrede data.
home-text4=Du kan også migrere databaser og data fra andre databaseleverandører til Sqlite-database.
db-section-text=Sqlite-database
analysis-text1=CuteSqlite giver dig mulighed for at analysere og optimere ydeevnen af SQL-sætninger.
analysis-text2=Og det giver dig mulighed for at analysere lagringskapaciteten for hver tabel i databasen,
analysis-text3=samt konfigurere databaseparametre for at optimere databasen.
perf-analysis-section-text=Ydeevneanalyse
error-text=Systemfejl:
create-database=Opret en ny database (Ctrl+N)
open-database=Åbn en database (Ctrl+O)
refresh-database=Opdater database (F5)
delete-database=Fjern valgt database fra listen (Del)
override-user-db=Data i den slettede fil kan ikke gendannes. Bekræft at overskrive databasen?
create-db-success-text=Database oprettet succesfuldt
open-db-exists-inlist=Databasen er allerede åben, gentag ikke handlingen
open-db-success-text=Database åbnet succesfuldt
delete-user-db=Bekræft at fjerne database "{dbName}" fra listen?
delete-db-success-text=Database fjernet fra listen succesfuldt
query-editor=Forespørgselseditor
history=Historik
history-tip=Historik (F8)
result-list=Resultater
result-info=Information
result-table-data=Tabeldata
table-properties=Tabelegenskaber
exec-select-sql=Udfør valgt forespørgsel (F9)
exec-all-sql=Udfør alle forespørgsler (F10)
explain-select-sql=Forklar (Explain) valgt SQL-sætning (F11)
explain-query-plan-sql=Forklar forespørgselsplan (Explain query plan) for valgt SQL-sætning (F12)
query-page-help=Autofuldførelsesfunktion: [Tab] -> næste fane; [Ctrl+Mellemrum] -> vis matchende tags; [Ctrl+Enter] -> vis alle tags
no-select-userdb=Ingen database valgt
no-sql-statement=Ingen SQL-sætning i forespørgselseditoren
no-sql-content=Intet SQL-indhold i forespørgselseditoren
show-form-view=Vis formularvisning
export-result-as=Eksporter som... (Ctrl+Alt+E)
copy-result-data=Kopiér data til udklipsholder
clear-all=Ryd alt
ok=OK
cancel=Annuller
export-text-description=Vælg format til eksport af data
csv-settings=CSV-indstillinger
csv-field-settings=Kolonner
csv-line-settings=Rækker
csv-charset-settings=Tegnsæt
excel-settings=Excel-indstillinger
sql-settings=SQL-indstillinger
export-fields-settings=Vælg kolonnerne, der skal eksporteres
terminated-by=Skilletegn
enclosed-by=Indesluttet af
escaped-by=Escape-tegn
field-terminated-by=Kolonneskilletegn
field-enclosed-by=Kolonne indesluttet af
field-escaped-by=Kolonne escape-tegn
line-terminated-by=Linjeseparator
add-column-name=Tilføj kolonnenavne i overskrift
csv-charset=Tegnsæt
excel-column-max-size=Grænse for tekstkolonnestørrelse
excel-decinmal-places=Decimaler
structure-only=Kun struktur
data-only=Kun data
structure-and-data=Struktur og data
select-all=Vælg alle
deselect-all=Fravælg alle
save-to-file=Gem til fil
expert-fmt-error=Vælg filformat til eksport af data
terminated-by-error=Indtast værdien for "Skilletegn"
enclosed-by-error=Indtast værdien for "Indesluttet af"
escaped-by-error=Indtast værdien for "Escape-tegn"
line-terminated-by-error=Værdien for "Linjeseparator" er forkert
excel-column-max-size-error=Indtast værdien for "Grænse for tekstkolonnestørrelse"
excel-decinmal-places-error=Indtast værdien for "Decimaler"
export-sql-error=Vælg SQL-indstillingerne
selected-fields-error=Vælg kolonnerne, der skal eksporteres
export-path-error=Indtast stien til eksportfilen
sql-notsupport-multitable-query-error=Eksport af resultater fra forespørgsler med flere tabeller og underforespørgsler understøttes ikke
export-success-text=Eksport succesfuld, {rows} rækker data eksporteret. Åbn fil?
open-the-file=Åbn fil
export-file-exists-prompt={export-path} findes allerede. Erstat?
limit-rows=Grænse for rækker
offset=Startrække
rows=Antal rækker
copy-all-rows-to-clipboard=Kopiér alle rækker til udklipsholder	Ctrl+Alt+A
copy-sel-rows-to-clipboard=Kopiér valgte rækker til udklipsholder	Ctrl+Alt+H
copy-all-rows-as-sql=Kopiér alle rækker som SQL	Ctrl+Alt+J
copy-sel-rows-as-sql=Kopiér valgte rækker som SQL	Ctrl+Alt+K
read-only=Skrivebeskyttet
filter=Filter (Ctrl+Alt+F)
filter-in-use=Filter i brug
refresh=Opdater (Ctrl+F5)
refresh-page=Opdater
new-row-tip=Ny række (Ctrl+Alt+N)
copy-row-tip=Kopiér række (Ctrl+Alt+C)
save-tip=Gem (Ctrl+Alt+S)
delete-tip=Slet valgte række (Ctrl+Del)
cancel-tip=Fortryd ændringer (Ctrl+Alt+Z)
revert-tip=Gendan
save=Gem
revert=Fortryd ændringer
column=Kolonnenavn
condition=Betingelse
value=Værdi
delete-confirm-text=Bekræft at slette valgte rækker?
query=Forespørgsel
result=Resultat
affected-rows=Berørte rækker
exec-time=Udførelsestid
transfer-time=Overførselstid
total-time=Samlet tid
database-create=Opret DB		Ctrl+N
database-open=Åbn DB		Ctrl+O
database-refresh=Opdater DB		Ctrl+R
database-delete=Slet DB		Del
database-copy=Kopiér DB som...	Ctrl+P
database-export-as-sql=Eksporter DB til SQL	Ctrl+E
database-import-from-sql=Importer SQL til DB	Ctrl+I
database-new=Opret
database-new-table=Tabel
database-new-view=Visning
database-new-trigger=Trigger
export-as-sql-text-description=Eksporter valgte databasetabeller/visninger/triggers som SQL
select-database=Valgt database
database-objects=Objekter
structure-and-data-settings=Indstillinger for struktur og data
insert-statement-settings=Indstillinger for INSERT-sætning
tbl-statement-settings=Indstillinger for tabelsætning
retain-column-text=Bevarel kolonnenavne i "Insert Into"
contain-multi-rows-text=Hver "Insert"-sætning indeholder flere rækker (VALUES)
retain-table-text=Bevarel gammel tabel (Create Table If Not Exists ...)
override-table-text=Overskriv gammel tabel (DROP TABLE, derefter CREATE TABLE)
import-from-sql-text-description=Batchudfør sætninger i SQL-fil.
abort-on-error-text=Stop ved fejl.
import-file-not-exists=Importeret SQL-fil findes ikke, vælg igen.
import-path-empty-error=Stien til importfilen må ikke være tom.
import=Importer
export=Eksporter
tbl-name=Tabelnavn
new-table=Opret tabel
new-view=Opret visning
new-trigger=Opret trigger
database=Database
schema=Schema
table-columns=Kolonner
table-indexes=Indekser
table-foreignkeys=Fremmednøgler
column-name=Kolonnenavn
data-type=Datatype
default=Standard
check=Tjek
index-name=Indeksnavn
index-type=Indekstype
index-unique=Unik
partial-clause=Delvis klausul
comments=Kommentarer
to-be-selected=Tilgængelige kolonner
selected=Valgte
up=▲
down=▼
no-columns-selected=Ingen kolonner valgt, vælg venligst
sql-preview=SQL-forhåndsvisning
tbl-name-empty=Tabelnavn må ikke være tomt
tbl-name-duplicated=Tabelnavn findes allerede
create-table-success-text=Tabel oprettet succesfuldt.
alter-table-success-text=Tabel ændret succesfuldt.
rename-table-success-text=Tabelnavn ændret succesfuldt.
delete-column-confirm-text=Den valgte kolonne refereres af et eller flere indekser. Sletning af denne kolonne vil også ændre de tilsvarende indekser. Bekræft at fortsætte sletning?
delete-index-confirm-text=Det valgte indeks refereres af en eller flere kolonner. Sletning af dette indeks vil også ændre de tilsvarende kolonner. Bekræft at fortsætte sletning?
delete-confirm-text=Bekræft at fortsætte sletning?
new-view=Opret visning
new-trigger=Opret trigger
create-a-view-name=Nyt visningsnavn
view-name-not-empty=Nyt visningsnavn må ikke være tomt
view-name-duplicated=Visningsnavn findes allerede
create-a-trigger-name=Triggernavn
trigger-name-not-empty=Triggernavn må ikke være tomt
trigger-name-duplicated=Triggernavn findes allerede
execute-sql-success=SQL udført succesfuldt
copy-db-success-text=Database kopieret succesfuldt
table-open=Åbn tabeldata		Alt+O
table-create=Opret tabel		Alt+N
table-alter=Ændr tabel		Alt+A
table-rename=Omdøb tabel		Alt+M
table-truncate=Tøm tabel		Alt+T
table-drop=Slet tabel		Alt+Del
table-copy-as=Kopiér tabel til...		Alt+P
table-sharding-as=Sharding		Alt+G
table-export=Eksporter tabel til...	Alt+E
table-import-sql=Importer fra SQL-fil	Alt+I
table-import-csv=Importer fra CSV-fil	Alt+J
table-manage-index=Administrer tabelindekser
table-manage-foreign-key=Administrer fremmednøgler i tabel
properties=Egenskaber
primary-key-duplicated=Primærnøgle defineret flere gange.
foreignkey-name=Fremmednøglenavn
referencing-columns=Kolonner i denne tabel
referenced-table=Refereret tabel
referenced-columns=Refererede kolonner
on-update=Ved opdatering
on-delete=Ved sletning
insert-new-column=Tilføj ny kolonne
insert-new-index=Tilføj nyt indeks
insert-new-foreignkey=Tilføj ny fremmednøgle
insert-del-column=Slet valgt kolonne
insert-del-index=Slet valgt indeks
insert-del-foreignkey=Slet valgt fremmednøgle
select-referenced-table-first=Vælg venligst den refererede tabel først
new-table-name=Nyt tabelnavn
table-name-not-empty=Nyt tabelnavn må ikke være tomt
table-name-duplicated=Nyt tabelnavn findes allerede
ai-column-exists=AUTOINCREMENT-kolonne findes allerede.
ai-fobidden-multi-pk=AUTOINCREMENT-kolonne findes allerede, flere primærnøglekolonner er ikke tilladt.
ai-column-must-integer=AUTOINCREMENT-kolonne skal være af typen INTEGER.
truncate-table-confirm-text=Efter tømning af tabellen kan data ikke gendannes. Bekræft at tømme?
truncate-table-success-text=Tabeldata tømt succesfuldt
drop-table-confirm-text=Efter sletning af tabellen kan data ikke gendannes. Bekræft at slette?
drop-table-success-text=Tabel slettet succesfuldt
copy-table-text-description=Konfigurer kopiparametre, understøtter tabelshards
from-db-name=Kildedatabase
from-tbl-name=Kildetabel
to-db-name=Måldatabase
to-tbl-name=Måltabel
table-sharding-setttings=Tabelshards
enable-table-sharding=Aktiver tabelshards
table-suffix-begin={suffix} Start heltal
table-suffix-end={suffix} Slut heltal
advanced-settings=Avancerede sharding-indstillinger
enable-copy-data-with-strategy=Aktiver strategi til at kopiere data til shardede tabeller
sharding-strategy-express-text=Shardingstrategiudtryk: {n}
preview-sql=Forhåndsvis SQL-sætning
structure-and-data-settings-unknown=Indstillinger for struktur og data ikke valgt
table-suffix-error=Ugyldigt sharding-heltal, indtast en korrekt værdi
target-table-name-no-n=Måltabellen skal indeholde strengen "{n}".
sharding-strategy-express-empty=Shardingstrategiudtryk må ikke være tomt
copy-table-success-text=Tabel kopieret succesfuldt.
start=Start
complete=Færdig
express-title=Shardingstrategiudtryk for tabel
functions=Funktioner
express-editor-help=Udtryk - dobbeltklik på en funktion eller et felt for at indsætte i editoren
import-from-csv-text-description=Konfiguration til import af data fra CSV-fil
source-csv-file=Sti til kilde-CSV-fil
target-database=Måldatabase
target-table=Måltabel
columns-setttings=Kolonner
csv-data=CSV-data
column-name-on-top=Første række som kolonnenavne
line-terminated-by=Linjeseparator
csv-null-as-keyword=null/NULL som SQL-nøgleord
encoding=Tegnsæt
import-success-text=Import succesfuld
incorrect-sql-statement=Forkert SQL-sætning
import-error-text=Importfejl
table-manage-columns=Administrer kolonner
table-drop-column=Slet kolonne
table-manage-indexes=Administrer indekser
table-drop-index=Slet indeks
create-view=Opret ny visning
open-view=Åbn visning
drop-view=Slet visning
create-trigger=Opret trigger
open-trigger=Åbn trigger
drop-trigger=Slet trigger
drop-view-confirm-text=Efter sletning af visningen kan den ikke gendannes. Bekræft at slette?
drop-view-success-text=Visning slettet succesfuldt
drop-trigger-confirm-text=Efter sletning af triggeren kan den ikke gendannes. Bekræft at slette?
drop-trigger-success-text=Trigger slettet succesfuldt
sql-templates=SQL-sætningsskabeloner
pragma-templates=Pragmas
sql-log=SQL-historik
clear-all=Ryd alt
use=Brug
explain=Forklar
top=Fastgør
untop=Løsriv
copy=Kopiér
delete=Slet
today=I dag
yestoday=Igår
delete-sql-log-confirm-text=Er du sikker på, at du vil slette SQL-loggen?
copy-to-clipboard=Kopieret til udklipsholder
save-success-text=Gemt succesfuldt
delete-success-text=Slettet succesfuldt
data-has-changed=Data er blevet ændret. Er du sikker på, at du vil lukke siden?
not-save-and-close=Gem ikke, luk
cancel=Annuller lukning
table-export-as=Eksporter datatabel	Alt+E
export-as-sql-success-text=Eksport succesfuld. Åbn fil?
new-query=Nyt forespørgselsvindue (F7)
save-current=Gem aktuelle (Ctrl+S)
save-all=Gem alle (Ctrl+Shift+S)
first-page=Første side
prev-page=Forrige side
next-page=Næste side
last-page=Sidste side
save-if-data-has-changed=Data er blevet ændret. Gem før lukning?
unsort=Fortryd sortering
tab-close-this=Luk denne
tab-close-others=Luk andre
tab-close-left=Luk alle til venstre
tab-close-right=Luk alle til højre
perf-analysis=Ydeevneanalyse
perf-analysis-reports=Analyserapporter
store-analysis=Lageranalyse
db-params=Databaseparametre
not-select-sql=Kun SELECT-sætninger understøttes
open-sql-log=Åbn SQL-historik for ydeevneanalyse (Ctrl+L)
add-sql-analysis=Indtast SQL-sætning til ydeevneanalyse (Ctrl+I)
sql-log-not-found=SQL-historik ikke fundet, kontroller om den er slettet
original-sql=Oprindelig SQL-sætning
where-clause-analysis=Analyse af WHERE-klausul
order-clause-analysis=Analyse af ORDER-klausul
covering-index-analysis=Analyse af dækkende indekser
table-join-analysis=JOIN-analyse
in-table=Datatabel
where-use-column=WHERE-sætning bruger kolonner
order-use-column=ORDER-sætning bruger kolonner
covering-index-column=WHERE- og ORDER-sætninger bruger kolonner
where-use-index=WHERE-sætning bruger indeks
order-use-index=ORDER-sætning bruger indeks
use-covering-index=Bruger dækkende indeks
create-index-for-performance=Anbefaling: opret et indeks for følgende kolonner for at forbedre forespørgselsydeevnen
hint-index-for-performance=Tip: indeks {hintIndexName} dækker allerede kolonnerne: {hintIndexColumns}
create-covering-index-for-performance=Anbefaling: opret et dækkende indeks for følgende kolonner for at forbedre forespørgselsydeevnen
create-index-togeger=Opret indeks (sammen)
create-index-individ=Opret indekser (hver for sig)
create-covering-index=Opret dækkende indeks
explain-query-plan=Forklar forespørgselsplan
query-optimizer-pseudocode=Pseudokoden nedenfor viser udførelsesprocessen for forespørgselsoptimatoren
cycle-count=Cyklusstatistikker
optimize-cycle-count=Tip: ændring af JOIN-rækkefølgen af tabeller kan optimere og reducere antallet af cyklusser.
general-settings=Generelle indstillinger
about=Om
language-setting=Sprogindstilling for brugergrænseflade
change-language-restart-text=Ændring af sprog kræver genstart af denne software.
close-and-restart=Luk og genstart
do-not-restart=Genstart ikke
about-us=Om os
about-us-description=CuteSqlite er open source-software udviklet af forfatteren Xuehan Qin.
version-info=Version
version-info-description=CuteSqlite v0.2.2 beta (64-bit)
feedback=Tilbagemelding
feedback-description=Hvis du har softwareproblemer, eller har ideer og forslag til denne applikation, skal du udfylde formularen nedenfor for at give os tilbagemelding.
content-text=Indhold
license=Apache Licens Version 2.0
select-columns-analysis=Analyse af SELECT-kolonner
select-use-column=SELECT-sætning bruger følgende kolonner
select-use-column-count=Antal kolonner
select-use-column-advice=Anbefaling: SELECT-sætning vælger mere end {maxColumns} kolonner. Reduktion af antallet af kolonner kan forbedre forespørgselsydeevnen.
select-use-column-tips=Tip: reduktion af antallet af kolonner kan forbedre forespørgselsydeevnen.
sql-perf-report-prefix=sql-ydeevnerapport-
store-analysis-prefix=Lageranalyse:
analysis-sql=SQL-analyse
open-perf-report=Åbn rapport		Alt+O
drop-perf-report=Slet rapport		Alt+Del
drop-perf-report-confirm-text=Bekræft at slette rapporten?
store-analysis-text=Giver dig mulighed for at analysere lagringskapaciteten for databasen, datatabeller, tabelindekser
table-store-analysis=Tabel - {tblName}
index-store-analysis=Indeks - {idxName} - Tabel: {tblName}
db-disk-used-title=Rapport over diskpladsforbrug, DB-sti: {dbPath}
page-size-text=Side størelse (byte)
page-size-tips=Side størelse (byte)
file-bytes-text=Filstørrelse (byte)
file-bytes-tips=Filstørrelse (byte)
file-pgcnt-text=Antal sider i hele filen (målt)
file-pgcnt-tips=Antal sider i hele filen (målt)
file-pgcnt2-text=Antal sider i hele filen (beregnet)
file-pgcnt2-tips=Antal sider i hele filen (beregnet)
inuse-pgcnt-text=Antal sider, der lagrer data (brugt)
inuse-pgcnt-tips=Antal sider, der lagrer data (brugt)
free-pgcnt2-text=Antal sider uden data (pr. header)
free-pgcnt2-tips=Antal sider uden data (pr. header)
free-pgcnt-text=Antal sider uden data (beregnet)
free-pgcnt-tips=Antal sider uden data (beregnet)
av-pgcnt-text=Antal automatisk tømte sider
av-pgcnt-tips=Antal automatisk tømte sider
ntable-text=Antal tabeller i databasen
ntable-tips=Antal tabeller i databasen
nindex-text=Antal indekser
nindex-tips=Antal indekser
nmanindex-text=Antal definerede indekser
nmanindex-tips=Antal definerede indekser
nautoindex-text=Antal implicitte indekser (automatisk stigende indekser)
nautoindex-tips=Antal implicitte indekser (automatisk stigende indekser)
user-payload-text=Bytes af brugerdata lagret
user-payload-tips=Bytes af brugerdata lagret
all-tbl-entrycnt-title=Samlede data for alle tabeller (antal poster)
all-tbl-idx-pagecnt-title=Antal sider for alle tabeller og deres indekser
sperate-tbl-idx-pagecnt-title=Sider for alle tabeller og indekser beregnet separat
all-tbl-idx-report-title=Alle tabeller og indekser
total-pages-percent-text=Procentdel af samlede databasesider
total-pages-percent-tips=Procentdel af samlede databasesider
nentry-text=Datamængde (antal poster)
nentry-tips=Datamængde (antal poster)
storage-text=Lagerbytes brugt
storage-tips=Lagerbytes brugt
compressed-size-text=Bytes brugt efter komprimering
compressed-size-tips=Bytes brugt efter komprimering
payload-text=Nyttelastbytes
payload-tips=Nyttelastbytes
total-meta-text=Metadatabytes
total-meta-tips=Metadatabytes
depth-text=B-træ-dybde
depth-tips=B-træ-dybde
avg-payload-text=Gennemsnitlig nyttelast pr. post
avg-payload-tips=Gennemsnitlig nyttelast pr. post
avg-unused-text=Gennemsnitlige ubrugte bytes pr. post
avg-unused-tips=Gennemsnitlige ubrugte bytes pr. post
avg-meta-text=Gennemsnitlige metadata pr. post
avg-meta-tips=Gennemsnitlige metadata pr. post
avg-fanout-text=Gennemsnitlig udstråling
avg-fanout-tips=Gennemsnitlig udstråling
gap-cnt-text=Ikke-sammenhængende sider
gap-cnt-tips=Ikke-sammenhængende sider
mx-payload-text=Maksimal nyttelast pr. post
mx-payload-tips=Maksimal nyttelast pr. post
ovfl-cnt-text=Antal brugte overløbsposter
ovfl-cnt-tips=Antal brugte overløbsposter
int-pages-text=Antal brugte indekssider
int-pages-tips=Antal brugte indekssider
leaf-pages-text=Antal brugte bladsider
leaf-pages-tips=Antal brugte bladsider
ovfl-pages-text=Antal brugte overløbssider
ovfl-pages-tips=Antal brugte overløbssider
total-pages-text=Samlet antal brugte sider
total-pages-tips=Samlet antal brugte sider
int-unused-text=Ubrugte bytes på indekssider
int-unused-tips=Ubrugte bytes på indekssider
leaf-unused-text=Ubrugte bytes på bladsider
leaf-unused-tips=Ubrugte bytes på bladsider
ovfl-unused-text=Ubrugte bytes på overløbssider
ovfl-unused-tips=Ubrugte bytes på overløbssider
total-unused-text=Ubrugte bytes på alle sider
total-unused-tips=Ubrugte bytes på alle sider
all-table-report-title=Alle tabeller (eksklusive indekser)
all-indices-report-title=Alle indekser (eksklusive tabeller)
tbl-and-all-idx-report-title=Tabel {tblName} og alle dens indekser
tbl-only-report-title=Tabel {tblName} (eksklusive eventuelle indekser)
idx-only-report-title=Alle indekser for tabel {tblName}
tbl-report-title=Tabel {tblName}
idx-report-title=Indeks {idxName} for tabel {tblName}
props-tbl-only-report-title=Lageranalyse af tabel {tblName}
props-idx-props-only-report-title=Alle indekser for tabel {tblName}
db-pragma-params=PRAGMA-parametre
db-quick-config-params=Hurtige konfigurationsmuligheder
select-pragma=PRAGMA
pragma-analysis-limit-tips=Forespørg eller ændr grænsen for analyseindstillinger (ANALYZE). Dette er det omtrentlige antal rækker, ANALYZE-kommandoen undersøger i hvert indeks.
pragma-application-id-tips=Bruges til at forespørge eller indstille det 32-bit fortegnede big-endian "Application ID"-heltal placeret ved offset 68 i databaseheaderen.
pragma-auto-vacuum-tips=Forespørg eller indstil auto-vacuum-status i databasen.
pragma-automatic-index-tips=Forespørg, aktivér eller deaktivér den automatiske indekseringsfunktion.
pragma-busy-timeout-tips=Forespørg eller ændr indstillingen for busy timeout.
pragma-cache-size-tips=Forespørg eller ændr det maksimale antal databasesidediske, som SQLite anbefaler at holde i hukommelsen for hver åben databasefil.
pragma-cache-spill-tips=Aktivér eller deaktivér pagineringsprogrammets evne til at skrive beskidte cachesider til databasefilen midt i en transaktion.
pragma-case-sensitive-like-tips=LIKE-operatorens standardadfærd ignorerer store og små bogstaver for ASCII-tegn. Som standard er 'a' LIKE 'A' således sandt.
pragma-cell-size-check-tips=Aktivér eller deaktivér yderligere sanity-kontroller ved læsning af database B-træ-sider fra disk. Når cellestørrelseskontrol er aktiveret, kan databasekorruption opdages tidligere og er mindre tilbøjelig til at "sprede sig".
pragma-checkpoint-fullfsync-tips=Forespørg eller ændr fullfsync-flaget for checkpoint-operationer. Hvis dette flag er indstillet, vil F_FULLFSYNC-synkroniseringsmetoden blive brugt under checkpoint-operationer på systemer, der understøtter F_FULLFSYNC. Standardværdien for CHECKPOINT_FULLFSYNC-flaget er OFF. Kun Mac OS-X understøtter F_FULLFSYNC.
pragma-collation-list-tips=Returnerer en liste over sorteringssekvenser defineret for den aktuelle databaseforbindelse.
pragma-compile-options-tips=Returnerer navnene på kompileringstidsindstillinger brugt ved opbygning af SQLite, en indstilling pr. række.
pragma-count-changes-tips=Forespørg eller ændr flaget for tælling af ændringer (count changes). Normalt, når count-changes-flaget ikke er indstillet, returnerer INSERT-, UPDATE- og DELETE-sætninger ikke data.
pragma-data-store-directory-tips=Forespørg eller ændr værdien af den globale variabel sqlite3_data_directory, der bruges af Windows-operativsystemets grænseflade-backend til at bestemme placeringen af databasefiler specificeret med en relativ sti.
pragma-data-version-tips=Indikerer, at databasefilen er blevet ændret. Interaktive programmer, der holder databaseindhold i hukommelsen eller viser dem på skærmen, kan bruge PRAGMA data_version-kommandoen til at afgøre, om de skal opdatere og genindlæse hukommelsen eller opdatere skærmvisningen.
pragma-default-cache-size-tips=Forespørg eller indstil det anbefalede maksimale antal diskcachesider, der vil blive allokeret for hver åben databasefil.
pragma-defer-foreign-keys-tips=Instruerer om, at alle fremmednøglebegrænsninger udskydes, indtil den yderste transaktion forpligtes.
pragma-empty-result-callbacks-tips=Forespørg eller ændr flaget for tilbagekald ved tomt resultat.
pragma-encoding-tips=Tekstkodningen, der bruges af hoveddatabasen: 'UTF-8', 'UTF-16le' (little-endian UTF-16) eller 'UTF-16be' (big-endian UTF-16).
pragma-foreign-key-check-tips=Tjekker databasen eller tabellen for overtrædelser af fremmednøglebegrænsninger.
pragma-foreign-keys-tips=Forespørg, aktivér eller deaktivér håndhævelse af fremmednøglebegrænsninger.
pragma-freelist-count-tips=Returnerer antallet af ubrugte sider i databasefilen.
pragma-full-column-names-tips=Forespørg eller ændr full_column_names-flaget.
pragma-fullfsync-tips=Forespørg eller ændr fullfsync-flaget. Dette flag afgør, om F_FULLFSYNC-synkroniseringsmetoden vil blive brugt på systemer, der understøtter den. Standardværdien for fullfsync er OFF. Kun Mac OS X understøtter F_FULLFSYNC.
pragma-hard-heap-limit-tips=Pålægger en grænse for mængden af heap-hukommelse for alle databaseforbindelser i en enkelt proces.
pragma-ignore-check-constraints-tips=Aktivér eller deaktivér håndhævelse af CHECK-begrænsninger. Standardindstillingen er OFF, hvilket betyder, at CHECK-begrænsninger håndhæves som standard.
pragma-incremental-vacuum-tips=Forårsager, at op til N sider fjernes fra freelisten.
pragma-integrity-check-tips=Udfører en lavniveaumæssig formaterings- og konsistenskontrol af databasen.
pragma-journal-mode-tips=Forespørg eller indstil journaltilstanden for databasen, der er knyttet til den aktuelle databaseforbindelse.
pragma-journal-size-limit-tips=Begrænser størrelsen af rollback-journaler og WAL-filer, der efterlades i filsystemet efter en transaktion eller et checkpoint.
pragma-legacy-alter-table-tips=Indstil eller forespørg værdien af legacy_alter_table-flaget.
pragma-locking-mode-tips=Indstil eller forespørg databaseforbindelsens låsetilstand. Tilstandene er NORMAL eller EXCLUSIVE.
pragma-max-page-count-tips=Forespørg eller indstil det maksimale antal sider i databasefilen.
pragma-mmap-size-tips=Forespørg eller ændr det maksimale antal bytes, der er reserveret til hukommelseskortlagt I/O på en enkelt database.
pragma-module-list-tips=Returnerer en liste over virtuelle tabelmoduler registreret hos databaseforbindelsen.
pragma-optimize-tips=Forsøger at optimere databasen.
pragma-page-count-tips=Returnerer det samlede antal sider i databasefilen.
pragma-page-size-tips=Forespørg eller indstil sidestørrelsen for databasen. Sidestørrelsen skal være en potens af to mellem 512 og 65536.
pragma-parser-trace-tips=Tænder for sporing af SQL-parseren, der bruges internt af SQLite. Virker kun, når der er kompileret med SQLITE_DEBUG.
pragma-query-only-tips=Forhindrer dataændringer i databasefilen. Når den er aktiveret, vil ethvert forsøg på CREATE, UPDATE, DROP, INSERT eller UPDATE resultere i en SQLITE_READONLY-fejl.
pragma-quick-check-tips=Udfører en lavniveaumæssig formaterings- og konsistenskontrol af databasen, idet den springer UNIQUE- og indekskonsistenskontroller over.
pragma-read-uncommitted-tips=Forespørg, aktivér eller deaktivér READ UNCOMMITTED-isolering.
pragma-recursive-triggers-tips=Forespørg, aktivér eller deaktivér rekursiv triggerkapacitet.
pragma-reverse-unordered-selects-tips=Når den er aktiveret, får denne PRAGMA mange SELECT-sætninger uden en ORDER BY-klausul til at returnere resultater i en rækkefølge, der normalt er omvendt.
pragma-schema-version-tips=Henter eller indstiller schema_version-heltallet ved offset 40 i databaseheaderen.
pragma-secure-delete-tips=Forespørg eller ændr indstillingen for sikker sletning (secure-delete).
pragma-short-column-names-tips=Forespørg eller ændr flaget for korte kolonnenavne.
pragma-soft-heap-limit-tips=Begrænser mængden af heap-hukommelse, der bruges af alle databaseforbindelser i en enkelt proces.
pragma-stats-tips=Returnerer hjælpeoplysninger om tabeller og indekser.
pragma-synchronous-tips=Forespørg eller ændr indstillingen af flaget "synchronous".
pragma-temp-store-tips=Forespørg eller ændr værdien af den globale variabel sqlite3_temp_directory, der bruges af mange operativsystemgrænseflade-backends til at bestemme, hvor midlertidige tabeller og indekser skal gemmes.
pragma-threads-tips=Antallet af hjælpetråde startet af en forberedt sætning til at hjælpe med forespørgslen.
pragma-trusted-schema-tips=Om det er tilladt at køre usikre SQL-funktioner og virtuelle tabeller i skemaet. Bestemmer, om visninger, triggere eller skemaudtryk (såsom CHECK-begrænsninger, DEFAULT-klausuler, genererede kolonner, udtryksindekser og/eller delvise indekser) må køre usikre SQL-funktioner og virtuelle tabeller.
pragma-user-version-tips=Henter eller indstiller user_version-heltallet ved offset 60 i databaseheaderen.
pragma-vdbe-addoptrace-tips=Komplette VDBE-opkoder vises under kodegenerering. Forudsat at SQLite er kompileret med SQLITE_DEBUG-indstillingen, og vdbe_debug er aktiveret.
pragma-vdbe-debug-tips=Tænder for VDBE-fejlfinding. Forudsat at SQLite er kompileret med SQLITE_DEBUG-indstillingen.
pragma-vdbe-listing-tips=Viser en komplet liste over virtuelle maskin-opkoder på standardoutput. Forudsat at SQLite er kompileret med SQLITE_DEBUG-indstillingen, og vdbe_debug er aktiveret.
pragma-vdbe-trace-tips=Udskriver virtuelle maskin-opkoder på standardoutput under beregning. Forudsat at SQLite er kompileret med SQLITE_DEBUG-indstillingen, og vdbe_debug er aktiveret.
pragma-wal-autocheckpoint-tips=Forespørg eller indstil auto-checkpoint-intervallet for write-ahead-loggen.
pragma-wal-checkpoint-tips=Forårsager, at indholdet af write-ahead-loggen for database X på databaseforbindelse D overføres til databasefilen og nulstiller write-ahead-loggen.
pragma-writable-schema-tips=Tillader, at sqlite_schema-tabellen ændres ved hjælp af almindelige UPDATE-, INSERT- og DELETE-sætninger. Advarsel: misbrug af denne pragma kan let resultere i korruption af databasefilen.
pragma-save-confirm=PRAGMA-sætninger vil påvirke databasedriften. Bekræft at udføre følgende sætning?
confirm-exec-text=Bekræft & Udfør